Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-deleteClinicalWorkflow"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-deleteClinicalWorkflow-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-deleteClinicalWorkflow"
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-deleteClinicalWorkflow-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-deleteClinicalWorkflow"
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Delete pending after 2 days clinical workflow using cron job."
      + filename                       = "builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip"
      + function_name                  = "svep-backend-deleteClinicalWorkflow"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 8192
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/deleteClinicalWorkflow",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip"
          + "timestamp" = "1765984211539284000"
        }
    }

  # module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-formatOutput.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-formatOutput"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-formatOutput.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-formatOutput"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-formatOutput-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-formatOutput"
    }

  # module.svep[0].module.lambda-formatOutput.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-formatOutput-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-formatOutput"
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Convert input list of dictionaries to a TSV file."
      + filename                       = "builds/0c9d550e0dccb7c961e16fd59d4885ff2e479bf883ca79a9ffd035f11ef8b134.zip"
      + function_name                  = "svep-backend-formatOutput"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/formatOutput",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0c9d550e0dccb7c961e16fd59d4885ff2e479bf883ca79a9ffd035f11ef8b134.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0c9d550e0dccb7c961e16fd59d4885ff2e479bf883ca79a9ffd035f11ef8b134.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/0c9d550e0dccb7c961e16fd59d4885ff2e479bf883ca79a9ffd035f11ef8b134.zip"
          + "timestamp" = "1765984211893045000"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-getResultsURL"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-getResultsURL"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-getResultsURL.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-getResultsURL-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-getResultsURL"
    }

  # module.svep[0].module.lambda-getResultsURL.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-getResultsURL-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-getResultsURL"
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Returns the presigned results URL for results"
      + filename                       = "builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip"
      + function_name                  = "svep-backend-getResultsURL"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-getResultsURL.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/getResultsURL",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip"
          + "timestamp" = "1765984210970378000"
        }
    }

  # module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-initQuery.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-initQuery"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-initQuery.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-initQuery"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-initQuery.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-initQuery-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-initQuery"
    }

  # module.svep[0].module.lambda-initQuery.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-initQuery-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-initQuery"
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes queryVCF with the calculated regions"
      + filename                       = "builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip"
      + function_name                  = "svep-backend-initQuery"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-initQuery.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/initQuery",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip"
          + "timestamp" = "1765984211043390000"
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-pluginClinvar"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginClinvar"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginClinvar-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginClinvar"
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginClinvar-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginClinvar"
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add ClinVar annotations to sVEP result rows."
      + filename                       = "builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip"
      + function_name                  = "svep-backend-pluginClinvar"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginClinvar.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginClinvar",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip"
          + "timestamp" = "1765984211691869000"
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-pluginConsequence"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginConsequence"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginConsequence-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginConsequence"
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginConsequence-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginConsequence"
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Queries VCF for a specified variant."
      + function_name                  = "svep-backend-pluginConsequence"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 600
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-pluginGnomad"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginGnomad"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomad-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomad"
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomad-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomad"
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add Gnomad annotations to sVEP result rows."
      + filename                       = "builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip"
      + function_name                  = "svep-backend-pluginGnomad"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomad",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip"
          + "timestamp" = "1765984211135874000"
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-pluginGnomadConstraint"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginGnomadConstraint"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomadConstraint-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomadConstraint"
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomadConstraint-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomadConstraint"
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add Gnomad Constraint annotations to sVEP result rows."
      + filename                       = "builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip"
      + function_name                  = "svep-backend-pluginGnomadConstraint"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadConstraint",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip"
          + "timestamp" = "1765984211645939200"
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-pluginGnomadOneKG"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginGnomadOneKG"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomadOneKG-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomadOneKG"
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomadOneKG-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomadOneKG"
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.